# NavisworksExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions Class
Members See Also
---
Options which controls the Navisworks export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class NavisworksExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class NavisworksExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class NavisworksExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..NavisworksExportOptions
# See Also
NavisworksExportOptions Members
Autodesk.Revit.DB Namespace